from userbot.utils import admin_cmd

@borg.on(admin_cmd(pattern="gnt$"))
async def gn(event):
    await event.edit("★彡 🌙 🅖🅞🅞🅓 🅝🅘🅖🅗🅣 🌙 彡★")
    
    
@borg.on(admin_cmd(pattern="gmg$"))
async def gm(event):
    await event.edit("♥️♡+:｡.｡ 🅖🅞🅞🅓 🅜🅞🅡🅝🅘🅝🅖 ｡.｡:+♡♥️")

    
@borg.on(admin_cmd(pattern="lm$"))
async def gn(event):
    await event.edit("♡ᶫᵒᵛᵉᵧₒᵤ ♡ [ GOOD MORNING ] ♡ᶫᵒᵛᵉᵧₒᵤ ♡")
    
    
@borg.on(admin_cmd(pattern="by$"))
async def gn(event):
    await event.edit("❤️🍃 🄱🅈🄴🄴🄴 🍃❤️")
    
    
@borg.on(admin_cmd(pattern="shoot$"))
async def gn(event):
    await event.edit("_/﹋\_\n(҂`_´)\n<,︻╦╤─ ҉ - -\n_/﹋\_")
    
@borg.on(admin_cmd(pattern="lvu$"))
async def gn(event):
    await event.edit("╔══╗╔╗ ♡ ♡ ♡\n╚╗╔╝║║╔═╦╦╦╔╗\n╔╝╚╗║╚╣║║║║╔╣\n╚══╝╚═╩═╩═╩═╝\nஜ۞ஜ YOU ஜ۞ஜ\n .\nI LOVE YOU")
    
    
@borg.on(admin_cmd(pattern="gm$"))
async def gn(event):
    await event.edit("*♥️.•´¸.•*´✶´♡ ¸.•*´´♡*💚˚*\n*_○💙_Good morning 💙*˚*\n*💚.•´¸.•*´✶´♡ ¸.•*´´♡⛅️*\n*° ☆ ° ˛*˛☆_Π__*_*˚☆*\n*˚ ˛★˛•˚ */____/ ~＼。˚ ˚\n*˚ ˛•˛•˚🌈｜ 田田 ｜門｜ ˚*\n*🌴╬═🌴╬╬🌴╬╬🌴═╬╬═🌴*╬╬🌴")
    
    
@borg.on(admin_cmd(pattern="gn$"))
async def gn(event):
    await event.edit("┊┊┊┊\n┊┊┊☆ \n┊┊🌙 *\n┊┊ GOOD NIGHT\n┊☆ °\n🌙*")
    
from userbot.utils import admin_cmd

@borg.on(admin_cmd(pattern="gn1$"))
async def gn1(event):
    await event.edit(".,-,*´'*°☆\n/.(\n\ { ۰۪۫G۪۫۰۰۪۫O۪۫۰۰۪۫O۪۫۰۰۪۫D۪۫۰ ۰۪۫N۪۫۰۰۪۫I۪۫۰۰۪۫G۪۫۰۰۪۫H۪۫۰۰۪۫T۪۫۰\n-`☆.¸¸.❤️")
    
    
@borg.on(admin_cmd(pattern="gm1$"))
async def gm1(event):
    await event.edit("(¯v´¯)\n.*.¸.*´ ❤️ . . . • '¸. • * '¨) ¸. • * ¨). •\nɢ∞פ  ʍօ®ɴɪɴɢ ❃──❋☆")    
    
    
@borg.on(admin_cmd(pattern="gn1$"))
async def gn1(event):
    await event.edit(".,-,*´'*°☆\n/.(\n\ { ۰۪۫G۪۫۰۰۪۫O۪۫۰۰۪۫O۪۫۰۰۪۫D۪۫۰ ۰۪۫N۪۫۰۰۪۫I۪۫۰۰۪۫G۪۫۰۰۪۫H۪۫۰۰۪۫T۪۫۰\n-`☆.¸¸.❤️")
    
    
@borg.on(admin_cmd(pattern="xx$"))
async def gm1(event):
    await event.edit("██████▀▀▀░░░░░░░▀▀▀██████\n███▀░░░░░░░░░░░░░░░░░▀███\n███▀░░░░░░░░░░░░░░░░░▀███\██│░░░░░░░░░░░░░░░░░░░│██\n█▌│░░░░░░░░░░░░░░░░░░░│▐█\n█░└┐░░░░░░░░░░░░░░░░░┌┘░█\n█░░└┐░░░░░░░░░░░░░░░┌┘░░█\n█░░┌┘▄▄▄▄▄░░░░░▄▄▄▄▄└┐░░█\n█▌░│██████▌░░░▐██████│░▐█\n██░│▐███▀▀░░▄░░▀▀███▌│░██\n█▀─┘░░░░░░░▐█▌░░░░░░░└─▀█\n█▄░░░▄▄▄▓░░▀█▀░░▓▄▄▄░░░▄█\n███▄─┘██▌░░░░░░░▐██└─▄███\n████░░▐█─┬┬┬┬┬┬┬─█▌░░████\n███▌░░░▀┬┼┼┼┼┼┼┼┬▀░░░▐███\n████▄░░░└┴┴┴┴┴┴┴┘░░░▄████\n██████▄░░░░░░░░░░░▄██████\n█████████▄▄▄▄▄▄▄█████████")


@borg.on(admin_cmd(pattern="gm1$"))
async def gm1(event):
    await event.edit("(¯v´¯)\n.*.¸.*´ ❤️ . . . • '¸. • * '¨) ¸. • * ¨). •\nɢ∞פ  ʍօ®ɴɪɴɢ ❃──❋☆")    


@borg.on(admin_cmd(pattern="sdi$"))
async def gm1(event):
    await event.edit("°°°·.°·..·°¯°·._.·  𝕊𝕒𝕕𝕙𝕚𝕚 ·._.·°¯°·.·° .·°°°\n")    

@borg.on(admin_cmd(pattern="love$"))
async def gn(event):
    await event.edit("───▄▄▄▄▄▄─────▄▄▄▄▄▄\n─▄█▓▓▓▓▓▓█▄─▄█▓▓▓▓▓▓█▄\n▐█▓▓▒▒▒▒▒▓▓█▓▓▒▒▒▒▒▓▓█\n█▓▓▒▒░╔╗╔═╦═╦═╦═╗░▒▒▓▓\n█▓▓▒▒░║╠╣╬╠╗║╔╣╩╣░▒▒▓▓\n▐█▓▓▒▒╚═╩═╝╚═╝╚═╝▒▒▓▓█\n─▀█▓▓▒▒░░░░░░░░░▒▒▓▓█▀\n───▀█▓▓▒▒░░░░░▒▒▓▓█▀\n─────▀█▓▓▒▒░▒▒▓▓█▀\n──────▀█▓▓▒▓▓█▀\n────────▀█▓█▀\n──────────▀")
